app/Controllers/Admin/HomeController.php

  function __construct()
  {
    $this->usm = model(UserModel::class);
    helper('cookie');
    $kuki = get_cookie('admin');
    $kuki = explode('_', $kuki, 2);
    $username = $kuki[0] ?? '';
    $this->akun = $this->usm->where('username', $username)->first() ?? [];
---
SELECT *
FROM `user`
WHERE `username` = 'admin'
AND `user`.`deleted_at` IS NULL
 LIMIT 1

  public function index()
  {
    $dm1 = strtotime('now');
    $dm2 = strtotime('-1 month');
    $dm3 = strtotime('-2 month');
    $trm = model(TransaksiModel::class);
    $bam = model(BarangTransaksiModel::class);
    $nama1 = date('F', $dm1);
    $nama2 = date('F', $dm2);
    $nama3 = date('F', $dm3);
    $pembelian1 = $trm->where('created_at >=', date('Y-m-01', $dm1))->where('created_at <=', date('Y-m-t', $dm1))->where('tipe', 'beli')->findAll() ?? [];
    $pembelian2 = $trm->where('created_at >=', date('Y-m-01', $dm2))->where('created_at <=', date('Y-m-t', $dm2))->where('tipe', 'beli')->findAll() ?? [];
    $pembelian3 = $trm->where('created_at >=', date('Y-m-01', $dm3))->where('created_at <=', date('Y-m-t', $dm3))->where('tipe', 'beli')->findAll() ?? [];
    $penjualan1 = $trm->where('created_at >=', date('Y-m-01', $dm1))->where('created_at <=', date('Y-m-t', $dm1))->where('tipe', 'jual')->findAll() ?? [];
    $penjualan2 = $trm->where('created_at >=', date('Y-m-01', $dm2))->where('created_at <=', date('Y-m-t', $dm2))->where('tipe', 'jual')->findAll() ?? [];
    $penjualan3 = $trm->where('created_at >=', date('Y-m-01', $dm3))->where('created_at <=', date('Y-m-t', $dm3))->where('tipe', 'jual')->findAll() ?? [];
    $masuk1 = $bam->where('created_at >=', date('Y-m-01', $dm1))->where('created_at <=', date('Y-m-t', $dm1))->where('tipe', 'masuk')->findAll() ?? [];
    $masuk2 = $bam->where('created_at >=', date('Y-m-01', $dm2))->where('created_at <=', date('Y-m-t', $dm2))->where('tipe', 'masuk')->findAll() ?? [];
    $masuk3 = $bam->where('created_at >=', date('Y-m-01', $dm3))->where('created_at <=', date('Y-m-t', $dm3))->where('tipe', 'masuk')->findAll() ?? [];
    $keluar1 = $bam->where('created_at >=', date('Y-m-01', $dm1))->where('created_at <=', date('Y-m-t', $dm1))->where('tipe', 'keluar')->findAll() ?? [];
    $keluar2 = $bam->where('created_at >=', date('Y-m-01', $dm2))->where('created_at <=', date('Y-m-t', $dm2))->where('tipe', 'keluar')->findAll() ?? [];
    $keluar3 = $bam->where('created_at >=', date('Y-m-01', $dm3))->where('created_at <=', date('Y-m-t', $dm3))->where('tipe', 'keluar')->findAll() ?? [];
    $data = [
      'barang_masuk' => count($bam->where('created_at >=', date('Y-m-01', $dm1))->where('created_at <=', date('Y-m-t', $dm1))->where('tipe', 'masuk')->findAll() ?? []),
      'barang_keluar' => count($bam->where('created_at >=', date('Y-m-01', $dm1))->where('created_at <=', date('Y-m-t', $dm1))->where('tipe', 'keluar')->findAll() ?? []),
      'pembelian' => count($pembelian1),
      'penjualan' => count($penjualan1),
      'chart' => [
        'pembelian' => [
          'bulan1' => count($pembelian1),
          'nama1' => $nama1,
          'bulan2' => count($pembelian2),
          'nama2' => $nama2,
          'bulan3' => count($pembelian3),
          'nama3' => $nama3,
        ],
        'penjualan' => [
          'bulan1' => count($penjualan1),
          'nama1' => $nama1,
          'bulan2' => count($penjualan2),
          'nama2' => $nama2,
          'bulan3' => count($penjualan3),
          'nama3' => $nama3,
        ],
---
SELECT *
FROM `transaksi`
WHERE `created_at` >= '2024-01-01'
AND `created_at` <= '2024-01-31'
AND `tipe` = 'beli'
AND `transaksi`.`deleted_at` IS NULL
SELECT *
FROM `transaksi`
WHERE `created_at` >= '2023-12-01'
AND `created_at` <= '2023-12-31'
AND `tipe` = 'beli'
AND `transaksi`.`deleted_at` IS NULL
SELECT *
FROM `transaksi`
WHERE `created_at` >= '2023-11-01'
AND `created_at` <= '2023-11-30'
AND `tipe` = 'beli'
AND `transaksi`.`deleted_at` IS NULL
SELECT *
FROM `transaksi`
WHERE `created_at` >= '2024-01-01'
AND `created_at` <= '2024-01-31'
AND `tipe` = 'jual'
AND `transaksi`.`deleted_at` IS NULL
SELECT *
FROM `transaksi`
WHERE `created_at` >= '2023-12-01'
AND `created_at` <= '2023-12-31'
AND `tipe` = 'jual'
AND `transaksi`.`deleted_at` IS NULL
SELECT *
FROM `transaksi`
WHERE `created_at` >= '2023-11-01'
AND `created_at` <= '2023-11-30'
AND `tipe` = 'jual'
AND `transaksi`.`deleted_at` IS NULL
SELECT *
FROM `barang_transaksi`
WHERE `created_at` >= '2024-01-01'
AND `created_at` <= '2024-01-31'
AND `tipe` = 'masuk'
AND `barang_transaksi`.`deleted_at` IS NULL
SELECT *
FROM `barang_transaksi`
WHERE `created_at` >= '2023-12-01'
AND `created_at` <= '2023-12-31'
AND `tipe` = 'masuk'
AND `barang_transaksi`.`deleted_at` IS NULL
SELECT *
FROM `barang_transaksi`
WHERE `created_at` >= '2023-11-01'
AND `created_at` <= '2023-11-30'
AND `tipe` = 'masuk'
AND `barang_transaksi`.`deleted_at` IS NULL
SELECT *
FROM `barang_transaksi`
WHERE `created_at` >= '2024-01-01'
AND `created_at` <= '2024-01-31'
AND `tipe` = 'keluar'
AND `barang_transaksi`.`deleted_at` IS NULL
SELECT *
FROM `barang_transaksi`
WHERE `created_at` >= '2023-12-01'
AND `created_at` <= '2023-12-31'
AND `tipe` = 'keluar'
AND `barang_transaksi`.`deleted_at` IS NULL
SELECT *
FROM `barang_transaksi`
WHERE `created_at` >= '2023-11-01'
AND `created_at` <= '2023-11-30'
AND `tipe` = 'keluar'
AND `barang_transaksi`.`deleted_at` IS NULL