app/Controllers/Admin/LoginController.php

  function post()
  {
    if (
      !$this->validate([
        'username' => 'required',
        'password' => 'required',
      ])
    ) {
      return redirect('admin.login.index')->with('response', ['status' => 'error', 'pesan' => 'gagal login']);
    }
    $usm = model(UserModel::class)->protect(false);
    $username = $this->request->getPost('username');
    $password = $this->request->getPost('password');
    $user = $usm->where(['username' => $username, 'role' => 'admin'])->first();
---
SELECT *
FROM `user`
WHERE `username` = 'admin'
AND `role` = 'admin'
AND `user`.`deleted_at` IS NULL
 LIMIT 1