app/Controllers/Admin/UserController.php

  function __construct()
  {
    // $this->am = model(AdminModel::class);
    $this->sm = model(UserModel::class);
    $this->sm = $this->sm->protect(false);
    helper('cookie');

    $kuki = get_cookie('admin');
    $kuki = explode('_', $kuki, 2);
    $username = $kuki[0] ?? '';
    $this->akun = $this->sm->where('username', $username)->first() ?? [];
---
SELECT *
FROM `user`
WHERE `username` = 'admin'
AND `user`.`deleted_at` IS NULL
 LIMIT 1

  public function index(): string
  {
    $siswa = $this->sm->where('id_user !=', 1)->findAll();
---
SELECT *
FROM `user`
WHERE `id_user` != 1
AND `user`.`deleted_at` IS NULL

  public function update()
  {
    $id = $this->request->getGet('id');
    if (empty($id)) {
      return redirect('admin.user.index');
    }
    $siswa = $this->sm->where('id_user', $id)->first();
---
SELECT *
FROM `user`
WHERE `id_user` = '3'
AND `user`.`deleted_at` IS NULL
 LIMIT 1

  function delete()
  {
    $id = $this->request->getPost('id_user');
    if (empty($id)) {
      return redirect('admin.user.index')->with('response', ['status' => false, 'pesan' => 'gagal menghapus']);
    }
    $siswa = $this->sm->where(['id_user' => $id])->first();
---
SELECT *
FROM `user`
WHERE `id_user` = '3'
AND `user`.`deleted_at` IS NULL
 LIMIT 1

  function reset()
  {

    $id = $this->request->getPost('id_user');
    if (empty($id)) {
      return redirect('admin.user.index')->with('response', ['status' => false, 'pesan' => 'gagal reset']);
    }
    $siswa = $this->sm->where(['id_user' => $id])->first();
---
SELECT *
FROM `user`
WHERE `id_user` = '3'
AND `user`.`deleted_at` IS NULL
 LIMIT 1