app/Filters/AdminFilter.php

SELECT *
FROM `user`
WHERE `username` = 'admin'
AND `token` = 'admin_40678920'
AND `role` = 'admin'
AND `user`.`deleted_at` IS NULL
 LIMIT 1
---
  public function before(RequestInterface $request, $arguments = null)
  {

    $gm = model(UserModel::class);
    helper('cookie');

    $kuki1 = get_cookie('admin');
    $kuki = explode('_', $kuki1, 2);
    $username = $kuki[0] ?? '';
    $token = $kuki[1] ?? '';
    $akun = $gm->where(['username' => $username, 'token' => $kuki1, 'role' => 'admin'])->first() ?? [];